ankuns/nrfx/mdk/nrf54h20_bbpr.svd
          <cluster>
            <name>FT</name>
            <description>Unspecified</description>
            <headerStructName>FICR_PRODTEST_FT</headerStructName>
            <access>read-write</access>
            <addressOffset>0x024</addressOffset>
            <register>
              <name>PROGVERSION1</name>
              <description>FT1 test program version.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PROGVERSION1</name>
                  <description>FT1 test program version</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PROGVERSION2</name>
              <description>FT2/EQA test program version.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PROGVERSION2</name>
                  <description>FT2/EQA test program version</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PASSID1</name>
              <description>FT1 pass ID.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>FT1 pass ID.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PASSID2</name>
              <description>FT2/EQA pass ID.</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>FT2/EQA pass ID.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>TIMESTAMP1</name>
              <description>Timestamp for when FT1 starts or ends (YYYYMMDDTHHMMSS)</description>
              <addressOffset>0x010</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>FT1 timestamp</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>TIMESTAMP2</name>
              <description>Timestamp for when FT2/EQA starts or ends (YYYYMMDDTHHMMSS)</description>
              <addressOffset>0x014</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>FT2/EQA timestamp</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>TRIM</name>
          <description>Unspecified</description>
          <headerStructName>FICR_TRIM</headerStructName>
          <access>read-write</access>
          <addressOffset>0x100</addressOffset>
          <cluster>
            <name>SYSCTRL</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_SYSCTRL</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0</addressOffset>
            <cluster>
              <name>FLL16M</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_FLL16M</headerStructName>
              <access>read-write</access>
              <addressOffset>0x0</addressOffset>
              <cluster>
                <name>CONFIG</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_FLL16M_CONFIG</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>CFGCKSW16M</name>
                  <description>Config value for SYSCTRL.FLL16M.CONFIG.CFGCKSW16M</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Config value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_FLL16M_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x4</addressOffset>
                <register>
                  <name>RCOARSE</name>
                  <description>Trim value for SYSCTRL.FLL16M.TRIM.RCOARSE</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>RFINE</name>
                  <description>Trim value for SYSCTRL.FLL16M.TRIM.RFINE</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for SYSCTRL.FLL16M.TRIM.VSUP</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>CKSW16MTRIM</name>
                  <description>Trim value for SYSCTRL.FLL16M.TRIM.CKSW16MTRIM</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TCOEF</name>
                  <description>Trim value for SYSCTRL.FLL16M.TRIM.TCOEF</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>LFRC</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_LFRC</headerStructName>
              <access>read-write</access>
              <addressOffset>0x18</addressOffset>
              <cluster>
                <name>CAL</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_LFRC_CAL</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>LFRCOSCTRIM</name>
                  <description>Trim value for SYSCTRL.LFRC.CAL.LFRCOSCTRIM</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>LFXO</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_LFXO</headerStructName>
              <access>read-write</access>
              <addressOffset>0x1C</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_LFXO_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>PDLOWERTHR</name>
                  <description>Trim value for SYSCTRL.LFXO.TRIM.PDLOWERTHR</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>PDUPPERTHR</name>
                  <description>Trim value for SYSCTRL.LFXO.TRIM.PDUPPERTHR</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>BIAS</name>
                  <description>Trim value for SYSCTRL.LFXO.TRIM.BIAS</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>PIXO</name>
                  <description>Trim value for SYSCTRL.LFXO.TRIM.PIXO</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TRIMBUS</name>
                  <description>Trim value for SYSCTRL.LFXO.TRIM.TRIMBUS</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>LFLPRC</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_LFLPRC</headerStructName>
              <access>read-write</access>
              <addressOffset>0x3C</addressOffset>
              <register>
                <name>VSUP</name>
                <description>Trim value for SYSCTRL.LFLPRC.TRIM.VSUP</description>
                <addressOffset>0x0</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>RCOARSE</name>
                <description>Trim value for SYSCTRL.LFLPRC.TRIM.RCOARSE</description>
                <addressOffset>0x4</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>RFINE</name>
                <description>Trim value for SYSCTRL.LFLPRC.TRIM.RFINE</description>
                <addressOffset>0x8</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>PWMFINE</name>
                <description>Trim value for SYSCTRL.LFLPRC.TRIM.PWMFINE</description>
                <addressOffset>0xC</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Trim value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>VDETPOF5V0</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_VDETPOF5V0</headerStructName>
              <access>read-write</access>
              <addressOffset>0x4C</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_VDETPOF5V0_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>POFWARN</name>
                  <description>Trim value for SYSCTRL.VDETPOF5V0.TRIM.POFWARN</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>HFXO</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SYSCTRL_HFXO</headerStructName>
              <access>read-write</access>
              <addressOffset>0x54</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SYSCTRL_HFXO_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x0</addressOffset>
                <register>
                  <name>AREG</name>
                  <description>Trim value for SYSCTRL.HFXO.TRIM.AREG</description>
                  <addressOffset>0x0</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>IBIAS</name>
                  <description>Trim value for SYSCTRL.HFXO.TRIM.IBIAS</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>PIXO</name>
                  <description>Trim value for SYSCTRL.HFXO.TRIM.PIXO</description>
                  <addressOffset>0x8</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>PDTHR</name>
                  <description>Trim value for SYSCTRL.HFXO.TRIM.PDTHR</description>
                  <addressOffset>0xC</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>VREF</name>
                  <description>Trim value for SYSCTRL.HFXO.TRIM.VREF</description>
                  <addressOffset>0x10</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>MULT2</name>
                  <description>Trim value for SYSCTRL.HFXO.TRIM.MULT2</description>
                  <addressOffset>0x14</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <register>
                <name>CLOAD</name>
                <description>Config value for SYSCTRL.HFXO.CLOAD</description>
                <addressOffset>0x18</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Config value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
