ankuns/nrfx/mdk/nrf54h20_bbpr.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_I3CCORE120">
      <name>GLOBAL_I3CCORE121</name>
      <description>I3CCORE 1</description>
      <baseAddress>0x2FBE1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_MCAN120</name>
      <description>MCAN</description>
      <baseAddress>0x2FBEF800</baseAddress>
      <headerStructName>MCAN</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>MCAN</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CREL</name>
          <description>Core Release Register</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DAY</name>
              <description>Time Stamp Day</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>MON</name>
              <description>Time Stamp Month</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>YEAR</name>
              <description>Time Stamp Year</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>SUBSTEP</name>
              <description>Sub-step of Core Release</description>
              <lsb>20</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>STEP</name>
              <description>Step of Core Release</description>
              <lsb>24</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>REL</name>
              <description>Core Release</description>
              <lsb>28</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ENDN</name>
          <description>Endian Register</description>
          <addressOffset>0x004</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ETV</name>
              <description>Endianness Test Value</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CUST</name>
          <description>Customer Register</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
        </register>
        <register>
          <name>DBTP</name>
          <description>Data Bit Timing and Prescaler Register</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DSJW</name>
              <description>Data (Re)Synchronization Jump Width</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>DTSEG2</name>
              <description>Data time segment after sample point</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DTSEG1</name>
              <description>Data time segment before sample point</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>DBRP</name>
              <description>Data Bit Rate Prescaler</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>TDC</name>
              <description>Transmitter Delay Compensation</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <description>Test Register</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LBCK</name>
              <description>Loop Back Mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Loop Back Mode is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Loop Back Mode is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>Control of Transmit Pin</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CanCore</name>
                  <description>controlled by the CAN Core, updated at the end of the CAN bit time</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Monitored</name>
                  <description>Sample Point can be monitored at pin m_can_tx</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Dominant</name>
                  <description>Dominant (0) level at pin m_can_tx</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Recessive</name>
                  <description>Recessive (1) at pin m_can_tx</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX</name>
              <description>Receive Pin</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Dominant</name>
                  <description>The CAN bus is dominant (m_can_rx = 0)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Recessive</name>
                  <description>The CAN bus is recessive (m_can_rx = '1')</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXBNP</name>
              <description>Tx Buffer Number Prepared</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>PVAL</name>
              <description>Prepared Valid</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotValid</name>
                  <description>Value of TXBNP not valid</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Valid</name>
                  <description>Value of TXBNP valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXBNS</name>
              <description>Tx Buffer Number Started</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>SVAL</name>
              <description>Started Valid</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotValid</name>
                  <description>Value of TXBNP not valid</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Valid</name>
                  <description>Value of TXBNP valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RWD</name>
          <description>RAM Watchdog</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>WDC</name>
              <description>Start value of the Message RAM Watchdog Counter. With the reset value of '00' the counter is
          disabled.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>WDV</name>
              <description>Actual Message RAM Watchdog Counter Value.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCR</name>
          <description>CC Control Register</description>
          <addressOffset>0x018</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INIT</name>
              <description>Initialization</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal Operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Initialization</name>
                  <description>Initialization is started</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCE</name>
              <description>Configuration Change Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The CPU has no write access to the protected configuration registers</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The CPU has write access to the protected configuration registers (while CCCR.INIT = '1')</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASM</name>
              <description>Restricted Operation Mode</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Normal CAN operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Restricted Operation Mode active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSA</name>
              <description>Clock Stop Acknowledge</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No clock stop acknowledged</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>MCAN may be set in power down by stopping m_can_hclk and m_can_cclk</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSR</name>
              <description>Clock Stop Request</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>No clock stop is requested</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Clock stop requested.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MON</name>
              <description>Bus Monitoring Mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Bus Monitoring Mode is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Bus Monitoring Mode is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAR</name>
              <description>Disable Automatic Retransmission</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Automatic retransmission of messages not transmitted successfully enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Automatic retransmission disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEST</name>
              <description>Test Mode Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Normal operation, register TEST holds reset values</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Test Mode, write access to register TEST enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDOE</name>
              <description>FD Operation Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>FD operation disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>FD operation enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRSE</name>
              <description>Bit Rate Switch Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Bit rate switching for transmissions disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Bit rate switching for transmissions enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UTSU</name>
              <description>Use Timestamping Unit</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Internal time stamping</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>External time stamping by TSU</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WMM</name>
              <description>Wide Message Marker</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>8-bit Message Marker used</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>16-bit Message Marker used, replacing 16-bit timestamps in Tx Event FIFO</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PXHD</name>
              <description>Protocol Exception Handling Disable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Protocol exception handling enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Protocol exception handling disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EFBI</name>
              <description>Edge Filtering during Bus Integration</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Edge filtering disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Two consecutive dominant tq required to detect an edge for hard synchronization</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXP</name>
              <description>Transmit Pause</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Transmit pause disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Transmit pause enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NISO</name>
              <description>Non ISO Operation</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CAN FD frame format according to ISO 11898-1:2015</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>CAN FD frame format according to Bosch CAN FD Specification V1.0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NBTP</name>
          <description>Nominal Bit Timing and Prescaler Register</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>NTSEG2</name>
              <description>Nominal Time segment after sample point</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>NTSEG1</name>
              <description>Nominal Time segment before sample point</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>NBRP</name>
              <description>Nominal Bit Rate Prescaler</description>
              <lsb>16</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>NSJW</name>
              <description>Nominal (Re)Synchronization Jump Width</description>
              <lsb>25</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
