ankuns/nrfx/mdk/nrf54h20_bbpr.svd
        <register>
          <name>PIDR_2</name>
          <description>Coresight peripheral identification registers.</description>
          <addressOffset>0xFE8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
        </register>
        <register>
          <name>PIDR_3</name>
          <description>Coresight peripheral identification registers.</description>
          <addressOffset>0xFEC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
        </register>
        <register>
          <name>CIDR_0</name>
          <description>Coresight component identification registers.</description>
          <addressOffset>0xFF0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
        </register>
        <register>
          <name>CIDR_1</name>
          <description>Coresight component identification registers.</description>
          <addressOffset>0xFF4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
        </register>
        <register>
          <name>CIDR_2</name>
          <description>Coresight component identification registers.</description>
          <addressOffset>0xFF8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
        </register>
        <register>
          <name>CIDR_3</name>
          <description>Coresight component identification registers.</description>
          <addressOffset>0xFFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_ETB</name>
      <description>Embedded Trace Buffer</description>
      <baseAddress>0xBF044000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ETB</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>RDP</name>
          <description>ETB RAM Depth Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ETB_RAM_DEPTH</name>
              <description>Defines the depth, in words, of the trace RAM.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STS</name>
          <description>ETB Status Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FULL</name>
              <description>RAM Full. The flag indicates when the RAM write pointer has wrapped around.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>TRIGGERED</name>
              <description>The Triggered bit is set when a trigger has been observed. This does not indicate that a trigger has been embedded in the trace data by the formatter, but is determined by the programming of the Formatter and Flush Control Register.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>ACQCOMP</name>
              <description>The acquisition complete flag indicates that capture has been completed when the formatter stops because of any of the methods defined in the Formatter and Flush Control Register, or TraceCaptEn = 0. This also results in FtStopped in the Formatter and Flush Status Register going HIGH.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>FTEMPTY</name>
              <description>Formatter pipeline empty. All data stored to RAM.</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RRD</name>
          <description>ETB RAM Read Data Register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RAM_READ_DATA</name>
              <description>Data read from the ETB Trace RAM.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RRP</name>
          <description>ETB RAM Read Pointer Register</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RAM_READ_POINTER</name>
              <description>Sets the read pointer used to read entries from the Trace RAM over the APB interface.</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RWP</name>
          <description>ETB RAM Write Pointer Register</description>
          <addressOffset>0x18</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RAM_WRITE_POINTER</name>
              <description>Sets the write pointer used to write entries from the CoreSight bus into the Trace RAM.</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TRG</name>
          <description>ETB Trigger Counter Register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGGER_COUNTER</name>
              <description>The counter is used as follows:Trace after - The counter is set to a large value, slightly less than the number of entries in the RAM. Trace before - The counter is set to a small value. Trace about - The counter is set to half the depth of the Trace RAM. This register must not be written to when trace capture is enabled (FtStopped=0, TraceCaptEn=1). If a write is attempted, the register is not updated. A read access is permitted with trace capture enabled.</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>ETB Control Register</description>
          <addressOffset>0x20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRACECAPTEN</name>
              <description>ETB Trace Capture Enable. This is the master enable bit forcing FtStopped HIGH when TraceCaptEn is LOW. When capture is disabled, any remaining data in the ATB formatter is stored to RAM. When all data is stored the formatter outputs FtStopped. Capture is fully disabled, or complete, when FtStopped goes HIGH. See ETB Formatter and Flush Status Register, FFSR, 0x300.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RWD</name>
          <description>ETB RAM Write Data Register</description>
          <addressOffset>0x24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RAM_WRITE_DATA</name>
              <description>Data written to the ETB Trace RAM. When trace capture is disabled, the contents of this register are placed into the ETB Trace RAM when this register is written to. Writing to this register increments the RAM Write Pointer Register. If trace capture is enabled, and this register is accessed, then a read from this register outputs 0xFFFFFFFF. Reads of this register never increment the RAM Write Pointer Register. A constant stream of 1s being output corresponds to a synchronization output from the ETB. If a write access is attempted, the data is not written into Trace RAM.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FFSR</name>
          <description>ETB Formatter and Flush Status Register</description>
          <addressOffset>0x300</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000002</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FLINPROG</name>
              <description>Flush In Progress. This is an indication of the current state of afvalids.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>FTSTOPPED</name>
              <description>Formatter stopped. The formatter has received a stop request signal and all trace data and post-amble has been output. Any more trace data on the ATB interface is ignored and atreadys goes HIGH.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FFCR</name>
          <description>ETB Formatter and Flush Control Register</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENFTC</name>
              <description>Do not embed Triggers into the formatted stream. Trace disable cycles and triggers are indicated by TRACECTL, where fitted. Can only be changed when FtStopped is HIGH. This bit is clear on reset.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>ENFCONT</name>
              <description>Continuous mode in the ETB corresponds to normal mode with the embedding of triggers. Can only be changed when FtStopped is HIGH. This bit is clear on reset.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>FONFLIN</name>
              <description>Set this bit to enable use of the flushin connection. This is clear on reset.</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>FONTRIG</name>
              <description>Generate flush using Trigger event. Set this bit to cause a flush of data in the system when a Trigger Event occurs. This bit is clear on reset. A Trigger Event is defined as when the Trigger counter reaches zero (where fitted) or, in the case of the trigger counter being zero (or not fitted), when trigin is HIGH.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>FONMAN</name>
              <description>Setting this bit causes a flush to be generated. This is cleared when this flush has been serviced. This bit is clear on reset.</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>TRIGIN</name>
              <description>Indicate a trigger on trigin being asserted.</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>TRIGEVT</name>
              <description>Indicate a trigger on a Trigger Event.</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>TRIGFL</name>
              <description>Indicates a trigger on Flush completion (afreadys being returned).</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>STOPFL</name>
              <description>This forces the FIFO to drain off any part-completed packets. Setting this bit enables this function but this is clear on reset (disabled).</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>STOPTRIG</name>
              <description>Stop the formatter after a Trigger Event is observed. Reset to disabled (zero).</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITMISCOP0</name>
          <description>Integration Test Miscellaneous Output Register 0</description>
          <addressOffset>0xEE0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACQCOMP</name>
              <description>Set the value of acqcomp.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>FULL</name>
              <description>Set the value of full output port.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITTRFLINACK</name>
          <description>Integration Test Trigger In and Flush In Acknowledge Register</description>
          <addressOffset>0xEE4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGINACK</name>
              <description>Set the value of triginack.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>FLUSHINACK</name>
              <description>Set the value of flushinack.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITTRFLIN</name>
          <description>Integration Test Trigger In and Flush In Register</description>
          <addressOffset>0xEE8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGIN</name>
              <description>Read the value of trigin.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>FLUSHIN</name>
              <description>Read the value of flushin.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITATBDATA0</name>
          <description>Integration Test ATB Data Register 0</description>
          <addressOffset>0xEEC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATDATA_0</name>
              <description>Read the value of atdatas[0].</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>ATDATA_7</name>
              <description>Read the value of atdatas[7].</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>ATDATA_15</name>
              <description>Read the value of atdatas[15].</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>ATDATA_23</name>
              <description>Read the value of atdatas[23].</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>ATDATA_31</name>
              <description>Read the value of atdatas[31].</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITATBCTR2</name>
          <description>Integration Test ATB Control Register 2</description>
          <addressOffset>0xEF0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATREADYS</name>
              <description>Set the value of atreadys.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>AFVALIDS</name>
              <description>Set the value of afvalids.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITATBCTR1</name>
          <description>Integration Test ATB Control Register 1</description>
          <addressOffset>0xEF4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATID</name>
              <description>Read the value of atids.</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITATBCTR0</name>
          <description>Integration Test ATB Control Register 0</description>
          <addressOffset>0xEF8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATVALID</name>
              <description>Read the value of atvalids.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>AFREADY</name>
              <description>Read the value of afreadys.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>ATBYTES</name>
              <description>Read the value of atbytess.</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCTRL</name>
          <description>Integration Mode Control Register</description>
          <addressOffset>0xF00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTEGRATION_MODE</name>
              <description>Allows the component to switch from functional mode to integration mode or back.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMSET</name>
          <description>Claim Tag Set Register</description>
          <addressOffset>0xFA0</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLAIMSET</name>
              <description>This claim tag bit is implemented</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMCLR</name>
          <description>Claim Tag Clear Register</description>
          <addressOffset>0xFA4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLAIMCLR</name>
              <description>The value present reflects the current setting of the Claim Tag.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LAR</name>
          <description>Lock Access Register</description>
          <addressOffset>0xFB0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACCESS_W</name>
              <description>A write of 0xC5ACCE55 enables further write access to this device. A write of any value other than 0xC5ACCE55 will have the affect of removing write access.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LSR</name>
          <description>Lock Status Register</description>
          <addressOffset>0xFB4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000003</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOCKEXIST</name>
              <description>Indicates that a lock control mechanism exists for this device. This bit reads as 0 when read from an external debugger (paddrdbg31 = 1) since external debugger accesses are not subject to Lock Registers.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>LOCKGRANT</name>
              <description>Returns the current status of the Lock. This bit reads as 0 when read from an external debugger (paddrdbg31 = 1) since external debugger accesses are not subject to Lock Registers.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>LOCKTYPE</name>
              <description>Indicates if the Lock Access Register (0xFB0) is implemented as 8-bit or 32-bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
