ankuns/nrfx/mdk/nrf54h20_bbpr.svd
        <register>
          <name>SYSCOUNTERH</name>
          <description>The higher 20-bits of the SYSCOUNTER</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The higher 20-bits of the SYSCOUNTER value.</description>
              <lsb>0</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>SYSCOUNTER busy status</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>SYSCOUNTER is ready for read</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>SYSCOUNTER is busy, so not ready for read (value returned in the field SYSCOUNTERH.VALUE is not valid)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERFLOW</name>
              <description>The SYSCOUNTERL overflow indication after reading it.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoOverflow</name>
                  <description>SYSCOUNTERL is not overflown</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Overflow</name>
                  <description>SYSCOUNTERL overflown</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>16</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>CC[%s]</name>
          <description>Unspecified</description>
          <headerStructName>GRTC_CC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x520</addressOffset>
          <register>
            <name>CCL</name>
            <description>Description cluster: The lower 32-bits of Capture/Compare register CC[n]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CCL</name>
                <description>Capture/Compare low value in 1 us</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CCH</name>
            <description>Description cluster: The higher 32-bits of Capture/Compare register CC[n]</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CCH</name>
                <description>Capture/Compare high value in 1 us</description>
                <lsb>0</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CCADD</name>
            <description>Description cluster: Count to add to CC[n] when this register is written.</description>
            <addressOffset>0x008</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Count to add to CC[n]</description>
                <lsb>0</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>REFERENCE</name>
                <description>Configure the Capture/Compare register</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SYSCOUNTER</name>
                    <description>Adds SYSCOUNTER value.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CC</name>
                    <description>Adds CC value.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CCEN</name>
            <description>Description cluster: Configure Capture/Compare register CC[n]</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ACTIVE</name>
                <description>Configure the Capture/Compare register</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Capture/Compare register CC[n] Disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Capture/Compare register CC[n] enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
