ankuns/nrfx/mdk/nrf54h20_bbpr.svd
          <register>
            <name>POWERDOWNACK</name>
            <description>Status of the power control signals acknowledgment during power down sequence.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VDD</name>
                <description>Waiting for VDD down ACK or not.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>Not waiting for VDD down ACK.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ack</name>
                    <description>Waiting for VDD down ACK.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDD2</name>
                <description>Waiting for VDD2 down ACK or not.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>Not waiting for VDD2 down ACK.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ack</name>
                    <description>Waiting for VDD2 down ACK.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEON</name>
            <description>Force ON the power supply.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VDD</name>
                <description>Force ON the VDD supply</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No Force ON.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ForceOn</name>
                    <description>Force ON.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDD2</name>
                <description>Force ON the VDD2 supply.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No Force ON.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ForceOn</name>
                    <description>Force ON.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEY</name>
                <description>Key to enable the writing to this register. Writes to this register are ignored if KEY is not set to 0xA66D.</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Write is allowed.</description>
                    <value>0xA66D</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORCEOFF</name>
            <description>Force OFF the power supply.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VDD</name>
                <description>Force OFF the VDD supply</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No Force OFF.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ForceOff</name>
                    <description>Force OFF.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDD2</name>
                <description>Force OFF the VDD2 supply.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NoOperation</name>
                    <description>No Force OFF.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ForceOff</name>
                    <description>Force OFF.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEY</name>
                <description>Key to enable the writing to this register. Writes to this register are ignored if KEY is not set to 0xA66D.</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <access>write-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Write is allowed.</description>
                    <value>0xA66D</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PUF</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_OTPC_PUF</headerStructName>
          <access>read-write</access>
          <addressOffset>0x540</addressOffset>
          <register>
            <name>READ</name>
            <description>Read the PUF word XORed with the PUF pad value.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Value</name>
                <description>PUF word from the the PUF bits stream XORed with the PUF pad value.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>Reads a 0 when the PUF is locked.</description>
                    <value>0x00000000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PAD</name>
            <description>The PUF pad value used to XOR with the PUF word read.</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>Value</name>
                <description>PUF pad value</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LOCK</name>
            <description>Locks the reads to the PUF.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOCK</name>
                <description>Enables the lock for PUF.READ.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>Pending</name>
                    <description>Read: The PUF.PAD is not written.
                    The PUF.READ is locked.</description>
                    <value>0x00000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Read: PUF.READ is not locked.</description>
                    <value>0x00000001</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Read: PUF.READ is locked.</description>
                    <value>0x00000002</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Write: Enables the lock (Ignores any other value written).</description>
                    <value>0x10CC10CC</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>WAITSTATES</name>
          <description>Wait states for OTP read.</description>
          <addressOffset>0x550</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000B</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>WAITSTATENUM</name>
              <description>Register to read the current number of wait states for the OTP read and
        to set a new value.</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>KEY</name>
              <description>Key to enable the writing to this register. Writes to this register are ignored if KEY is not set to 0xA66D.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Allowed</name>
                  <description>Write is allowed.</description>
                  <value>0xA66D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STANDBYTIMEOUT</name>
          <description>Timeout to go into standby mode.</description>
          <addressOffset>0x554</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMEOUT</name>
              <description>Timeout in terms of OTPC clock cycles, based on FREQUENCY.</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY</name>
          <description>Clock frequency of OTPC.</description>
          <addressOffset>0x558</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000064</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FREQUENCY</name>
              <description>Frequency in MHz.</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>REGION[%s]</name>
          <description>Description collection: Configuration for region [n]</description>
          <addressOffset>0x560</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>READ</name>
              <description>Read configuration to the region [n].</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Allowed</name>
                  <description>Reads to the region [n] allowed.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotAllowed</name>
                  <description>Reads to the region [n] not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRITE</name>
              <description>Write configuration to the region [n].</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Allowed</name>
                  <description>Writes to the region [n] allowed.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotAllowed</name>
                  <description>Writes to the region [n] not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXECUTE</name>
              <description>Code execute configuration to the region [n].</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Allowed</name>
                  <description>Code execute from the region [n] allowed.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotAllowed</name>
                  <description>Code execute from region [n] not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock writes to this register.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLocked</name>
                  <description>Register is not locked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Register is locked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>TEST</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_OTPC_TEST</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>TESTMODE</name>
            <description>Register for entering test mode. Refer to the OTP test flow documentation for
      more details.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTMODE</name>
                <description>Register for entering test mode. This register does not return the same value
        as written.</description>
                <lsb>0</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>Read: In normal mode.</description>
                    <value>0x0000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TESTMODE1</name>
                    <description>Read: In TESTMODE1 mode.</description>
                    <value>0x0001</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TESTMODE2</name>
                    <description>Read: In TESTMODE2 mode.</description>
                    <value>0x0002</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>SetNORMAL</name>
                    <description>Write: Sets NORMAL mode.</description>
                    <value>0x0000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SetTESTMODE1</name>
                    <description>Write: Sets TESTMODE1. Used for production tests.</description>
                    <value>0xBCDE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SetTESTMODE2</name>
                    <description>Write: Sets TESTMODE2. Used for production tests (Direct access to OTP macro signals).</description>
                    <value>0xABCD</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LOCKTESTMODE</name>
            <description>Enables the lock for the TEST.TESTMODE</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EnableLock</name>
                <description>Enables the lock for TEST.TESTMODE.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>LockDisabled</name>
                    <description>Read: TEST.TESTMODE is not locked.</description>
                    <value>0x00000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LockEnabled</name>
                    <description>Read: TEST.TESTMODE is locked.</description>
                    <value>0x00000001</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>EnableLock</name>
                    <description>Write: Enables the lock (Ignores any other value written).</description>
                    <value>0x10CC10CC</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TESTMODE1</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_OTPC_TESTMODE1</headerStructName>
          <access>read-write</access>
          <addressOffset>0x610</addressOffset>
          <cluster>
            <name>EMEMORY</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_OTPC_TESTMODE1_EMEMORY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>READ</name>
              <description>Configures the OTP memory read mode. The PTM signals of the
                  OTP macro are set accordingly to this read mode during reads.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>READ</name>
                  <description>OTP mempory read mode.</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Normal</name>
                      <description>Normal read mode.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PGMMargin</name>
                      <description>PGM margin read mode.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>InitialMargin</name>
                      <description>Initial margin read mode.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>PTR</name>
              <description>Enables the PTR (PTR is the direct signal to the
                  OTP macro, it enables the test row) for read or write. When
                  enabled, the read and writes goes to test row instead of main
                  OTP memory.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PTR</name>
                  <description>Enable PTR.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable PTR.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable PTR.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
